## ESSENTIALS
brew "zplug"
brew "zsh"
brew "zsh-completions"

cask "iterm2"
cask "1password"
cask "zen"

mas "1Password for Safari", id: 1569813296
mas "Magnet", id: 441258766

## REST
tap "charmbracelet/tap"
tap "shivammathur/php"

brew "sqlite"
brew "aws-shell"
brew "awscli"
brew "bat"
brew "brew-php-switcher"
brew "curl"
brew "php"
brew "composer"
brew "docker-compose"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-standup"
brew "glow"
brew "go"
brew "gum"
brew "helm"
brew "hr"
brew "htop"
brew "httpie"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lsd"
brew "mas"
brew "mkcert"
brew "mysql-client"
brew "ncdu"
brew "nginx"
brew "nmap"
brew "pinentry"
brew "pinentry-mac"
brew "postgresql@14"
brew "pre-commit"
brew "pwgen"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "rustup"
brew "starship"
brew "the_silver_searcher"
brew "tmux"
brew "tokei"
brew "trash"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"

cask "bartender"
cask "cleanshot"
cask "docker-desktop"
cask "fantastical"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "iina"
cask "iterm2"
cask "jetbrains-toolbox"
cask "mimestream"
cask "mullvad-vpn"
cask "ngrok"
cask "signal"
cask "slack"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "whatsapp"
