tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "shivammathur/php"
tap "charmbracelet/tap"

# required for App Store installation
brew "mas"

mas "Magnet", id: 441258766
mas "ToothFairy", id: 1191449274

brew "zsh"
brew "zsh-completions"
brew "lsd"
brew "starship"
cask "iterm2"

cask "google-chrome-dev", args: {force: true}
cask "1password"
cask "slack"
cask "telegram"

cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "spotify"
cask "zoom"
cask "cleanshot"
cask "bartender"
cask "istat-menus"
cask "docker"
cask "dash"
cask "fantastical"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-office-code-pro"
cask "iina"
cask "minikube"
cask "ngrok"
cask "perimeter81"

mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Tweetbot", id: 1384080005
mas "Parcel", id: 639968404

brew "aws-shell"
brew "awscli"
brew "brew-php-switcher"
brew "composer"
brew "curl"
brew "curl-openssl"
brew "docker-compose"
brew "fzf"
brew "gh"
brew "git"
brew "git-standup"
brew "glow"
brew "go"
brew "helm"
brew "htop"
brew "httpie"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "mcrypt"
brew "mkcert"
brew "mysql-client"
brew "ncdu"
brew "nginx"
brew "nmap"
brew "php@7.1"
brew "php@7.4"
brew "php@8.0"
brew "pinentry"
brew "pinentry-mac"
brew "postgresql"
brew "pre-commit"
brew "pwgen"
brew "python@2"
brew "python@3.8"
brew "redis"
brew "ruby"
brew "sqlite"
brew "the_silver_searcher"
brew "tmux"
brew "tokei"
brew "trash"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "youtube-dl"
